Pandas 패키지에서는 이러한 표 데이터를 다루기 위한 시리즈(Series) 클래스와 데이터프레임(DataFrame) 클래스를 제공한다.

시리즈 = 값(value) + 인덱스(index)

데이터를 리스트나 1차원 배열 형식으로 Series 클래스 생성자에 넣어주면 시리즈 클래스 객체를 만들 수 있다. 인덱스의 길이는 데이터의 길이와 같아야 한다.

In [38]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
s = pd.Series([9904312, 3448737, 2890451, 2466052],
              index=["서울", "부산", "인천", "대구"])
s

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

만약 인덱스를 지정하지 않고 시리즈를 만들면 시리즈의 인덱스는 0부터 시작하는 정수값이 된다.

In [3]:
pd.Series(range(10, 14))

0    10
1    11
2    12
3    13
dtype: int64

In [4]:
s.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [5]:
s.values

array([9904312, 3448737, 2890451, 2466052], dtype=int64)

name 속성을 이용하여 시리즈 데이터에 이름을 붙일 수 있다. index.name 속성으로 시리즈의 인덱스에도 이름을 붙일 수 있다.

In [6]:
s.name = "인구"
s.index.name = "도시"
s

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [7]:
s[1], s["부산"]

(3448737, 3448737)

In [8]:
s[[0, 3, 1]]

도시
서울    9904312
대구    2466052
부산    3448737
Name: 인구, dtype: int64

In [9]:
s[s> 1000]

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [10]:
s[s < 3000000]

도시
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [11]:
s[0:2]

도시
서울    9904312
부산    3448737
Name: 인구, dtype: int64

In [12]:
s["부산":"대구"]

도시
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [13]:
"서울" in s

True

In [14]:
for k, v in s.items():
    print("%s == %d" % (k, v))

서울 == 9904312
부산 == 3448737
인천 == 2890451
대구 == 2466052

다른 예시

In [15]:
s2 = pd.Series({"서울": 9631482, "부산": 3393191, "인천": 2632035, "대전": 1490158})
s2

서울    9631482
부산    3393191
인천    2632035
대전    1490158
dtype: int64

In [16]:
s2[1]

3393191

In [17]:
s - s2

대구         NaN
대전         NaN
부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [18]:
s.values - s2.values

array([272830,  55546, 258416, 975894], dtype=int64)

In [19]:
rs = (s - s2) / s2 * 100
rs = rs[rs.notnull()]
rs

부산    1.636984
서울    2.832690
인천    9.818107
dtype: float64

In [20]:
rs["대구"] = 1.41
rs

부산    1.636984
서울    2.832690
인천    9.818107
대구    1.410000
dtype: float64

In [21]:
del rs["서울"]
rs

부산    1.636984
인천    9.818107
대구    1.410000
dtype: float64

2차원 행렬 Data-Frame

In [22]:
data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2431774],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율": [0.0283, 0.0163, 0.0982, 0.0141]
}
columns = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"]
index = ["서울", "부산", "인천", "대구"]
df = pd.DataFrame(data, index=index, columns=columns)
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [23]:
df.values

array([['수도권', 9904312, 9631482, 9762546, 9853972, 0.0283],
       ['경상권', 3448737, 3393191, 3512547, 3655437, 0.0163],
       ['수도권', 2890451, 2632035, 2517680, 2466338, 0.0982],
       ['경상권', 2466052, 2431774, 2456016, 2473990, 0.0141]], dtype=object)

In [24]:
df.columns

Index(['지역', '2015', '2010', '2005', '2000', '2010-2015 증가율'], dtype='object')

In [25]:
df.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [26]:
df.index.name = "도시"
df.columns.name = "특성"
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [27]:
df.T

도시                  서울       부산       인천       대구
특성
지역                 수도권      경상권      수도권      경상권
2015           9904312  3448737  2890451  2466052
2010           9631482  3393191  2632035  2431774
2005           9762546  3512547  2517680  2456016
2000           9853972  3655437  2466338  2473990
2010-2015 증가율   0.0283   0.0163   0.0982   0.0141

In [28]:
df["2010-2015 증가율"] = df["2010-2015 증가율"] * 100
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972           2.83
부산  경상권  3448737  3393191  3512547  3655437           1.63
인천  수도권  2890451  2632035  2517680  2466338           9.82
대구  경상권  2466052  2431774  2456016  2473990           1.41

In [29]:
df["test"] = df["2000"] * 2
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율      test
도시
서울  수도권  9904312  9631482  9762546  9853972           2.83  19707944
부산  경상권  3448737  3393191  3512547  3655437           1.63   7310874
인천  수도권  2890451  2632035  2517680  2466338           9.82   4932676
대구  경상권  2466052  2431774  2456016  2473990           1.41   4947980

In [30]:
del df["test"]

In [31]:
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972           2.83
부산  경상권  3448737  3393191  3512547  3655437           1.63
인천  수도권  2890451  2632035  2517680  2466338           9.82
대구  경상권  2466052  2431774  2456016  2473990           1.41

In [32]:
df["2010"]

도시
서울    9631482
부산    3393191
인천    2632035
대구    2431774
Name: 2010, dtype: int64

In [33]:
df[["2010"]]

특성     2010
도시
서울  9631482
부산  3393191
인천  2632035
대구  2431774

In [34]:
df[:1]

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972           2.83

In [35]:
df[0:2]

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972           2.83
부산  경상권  3448737  3393191  3512547  3655437           1.63

In [36]:
df["2015"]["서울"]

9904312

새로운 예제

In [40]:
df2 = pd.DataFrame({'A' : 1.,
                    'B' : pd.Timestamp('20130102'),
                    'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
                    'D' : np.array([3] * 4,dtype='int32'),
                    'E' : pd.Categorical(["test","train","test","train"]),
                    'F' : 'foo' })
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [41]:
df.tail(2)

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
인천  수도권  2890451  2632035  2517680  2466338           9.82
대구  경상권  2466052  2431774  2456016  2473990           1.41

In [42]:
df.sort_index(axis=1, ascending=False)

특성   지역     2015  2010-2015 증가율     2010     2005     2000
도시
서울  수도권  9904312           2.83  9631482  9762546  9853972
부산  경상권  3448737           1.63  3393191  3512547  3655437
인천  수도권  2890451           9.82  2632035  2517680  2466338
대구  경상권  2466052           1.41  2431774  2456016  2473990

In [44]:
df.sort_index(axis=1, ascending=False)

특성   지역     2015  2010-2015 증가율     2010     2005     2000
도시
서울  수도권  9904312           2.83  9631482  9762546  9853972
부산  경상권  3448737           1.63  3393191  3512547  3655437
인천  수도권  2890451           9.82  2632035  2517680  2466338
대구  경상권  2466052           1.41  2431774  2456016  2473990

In [45]:
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972           2.83
부산  경상권  3448737  3393191  3512547  3655437           1.63
인천  수도권  2890451  2632035  2517680  2466338           9.82
대구  경상권  2466052  2431774  2456016  2473990           1.41

In [46]:
df.sort_values(by="2010")

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
대구  경상권  2466052  2431774  2456016  2473990           1.41
인천  수도권  2890451  2632035  2517680  2466338           9.82
부산  경상권  3448737  3393191  3512547  3655437           1.63
서울  수도권  9904312  9631482  9762546  9853972           2.83

In [48]:
df.columns

Index(['지역', '2015', '2010', '2005', '2000', '2010-2015 증가율'], dtype='object', name='특성')

In [49]:
df.loc["서울":"인천", ['2010','2015']]

특성     2010     2015
도시
서울  9631482  9904312
부산  3393191  3448737
인천  2632035  2890451

In [50]:
df.iloc[3]

특성
지역                   경상권
2015             2466052
2010             2431774
2005             2456016
2000             2473990
2010-2015 증가율       1.41
Name: 대구, dtype: object

In [52]:
df.iloc[1,3]

3512547

In [53]:
df.iloc[3:5,0:2]

특성   지역     2015
도시
대구  경상권  2466052

In [55]:
df.iloc[[1,2,3],[0,2]]

특성   지역     2010
도시
부산  경상권  3393191
인천  수도권  2632035
대구  경상권  2431774

In [56]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [57]:
df2[df2['E'].isin(['test'])]

     A          B    C  D     E    F
0  1.0 2013-01-02  1.0  3  test  foo
2  1.0 2013-01-02  1.0  3  test  foo

In [58]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102', periods=6))

TypeError: Categorical is not ordered for operation max
you can use .as_ordered() to change the Categorical to an ordered one